Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F08KL302.h
#define _ECCP1AS_ECCPASE_POSITION                0x00000007
#define _ECCP1AS_ECCPASE_MASK                    0x00000080
#define _ECCP1AS_ECCPASE_LENGTH                  0x00000001

#define _ECCP1AS_PSSBD0_POSITION                 0x00000000
#define _ECCP1AS_PSSBD0_MASK                     0x00000001
#define _ECCP1AS_PSSBD0_LENGTH                   0x00000001

#define _ECCP1AS_PSSBD1_POSITION                 0x00000001
#define _ECCP1AS_PSSBD1_MASK                     0x00000002
#define _ECCP1AS_PSSBD1_LENGTH                   0x00000001

#define _ECCP1AS_PSSAC0_POSITION                 0x00000002
#define _ECCP1AS_PSSAC0_MASK                     0x00000004
#define _ECCP1AS_PSSAC0_LENGTH                   0x00000001

#define _ECCP1AS_PSSAC1_POSITION                 0x00000003
#define _ECCP1AS_PSSAC1_MASK                     0x00000008
#define _ECCP1AS_PSSAC1_LENGTH                   0x00000001

#define _ECCP1AS_ECCPAS0_POSITION                0x00000004
#define _ECCP1AS_ECCPAS0_MASK                    0x00000010
#define _ECCP1AS_ECCPAS0_LENGTH                  0x00000001

#define _ECCP1AS_ECCPAS1_POSITION                0x00000005
#define _ECCP1AS_ECCPAS1_MASK                    0x00000020
#define _ECCP1AS_ECCPAS1_LENGTH                  0x00000001

#define _ECCP1AS_ECCPAS2_POSITION                0x00000006
#define _ECCP1AS_ECCPAS2_MASK                    0x00000040
#define _ECCP1AS_ECCPAS2_LENGTH                  0x00000001

#define _ECCP1AS_PSS1BD_POSITION                 0x00000000
#define _ECCP1AS_PSS1BD_MASK                     0x00000003
#define _ECCP1AS_PSS1BD_LENGTH                   0x00000002

#define _ECCP1AS_PSS1AC_POSITION                 0x00000002
#define _ECCP1AS_PSS1AC_MASK                     0x0000000C
#define _ECCP1AS_PSS1AC_LENGTH                   0x00000002

#define _ECCP1AS_ECCP1AS_POSITION                0x00000004
#define _ECCP1AS_ECCP1AS_MASK                    0x00000070
#define _ECCP1AS_ECCP1AS_LENGTH                  0x00000003

#define _ECCP1AS_PSS1BD0_POSITION                0x00000000
#define _ECCP1AS_PSS1BD0_MASK                    0x00000001
#define _ECCP1AS_PSS1BD0_LENGTH                  0x00000001

#define _ECCP1AS_PSS1BD1_POSITION                0x00000001
#define _ECCP1AS_PSS1BD1_MASK                    0x00000002
#define _ECCP1AS_PSS1BD1_LENGTH                  0x00000001

#define _ECCP1AS_PSS1AC0_POSITION                0x00000002
#define _ECCP1AS_PSS1AC0_MASK                    0x00000004
#define _ECCP1AS_PSS1AC0_LENGTH                  0x00000001

#define _ECCP1AS_PSS1AC1_POSITION                0x00000003
#define _ECCP1AS_PSS1AC1_MASK                    0x00000008
#define _ECCP1AS_PSS1AC1_LENGTH                  0x00000001

#define _ECCP1AS_ECCP1AS0_POSITION               0x00000004
#define _ECCP1AS_ECCP1AS0_MASK                   0x00000010
#define _ECCP1AS_ECCP1AS0_LENGTH                 0x00000001

#define _ECCP1AS_ECCP1AS1_POSITION               0x00000005
#define _ECCP1AS_ECCP1AS1_MASK                   0x00000020
#define _ECCP1AS_ECCP1AS1_LENGTH                 0x00000001

#define _ECCP1AS_ECCP1AS2_POSITION               0x00000006
#define _ECCP1AS_ECCP1AS2_MASK                   0x00000040
#define _ECCP1AS_ECCP1AS2_LENGTH                 0x00000001

#define _PSTR1CON_STRA_POSITION                  0x00000000
#define _PSTR1CON_STRA_MASK                      0x00000001
#define _PSTR1CON_STRA_LENGTH                    0x00000001

#define _PSTR1CON_STRB_POSITION                  0x00000001
#define _PSTR1CON_STRB_MASK                      0x00000002
#define _PSTR1CON_STRB_LENGTH                    0x00000001

#define _PSTR1CON_STRC_POSITION                  0x00000002
#define _PSTR1CON_STRC_MASK                      0x00000004
#define _PSTR1CON_STRC_LENGTH                    0x00000001

#define _PSTR1CON_STRD_POSITION                  0x00000003
#define _PSTR1CON_STRD_MASK                      0x00000008
#define _PSTR1CON_STRD_LENGTH                    0x00000001

#define _PSTR1CON_STRSYNC_POSITION               0x00000004
#define _PSTR1CON_STRSYNC_MASK                   0x00000010
#define _PSTR1CON_STRSYNC_LENGTH                 0x00000001

#define _PSTR1CON_CMPL_POSITION                  0x00000006
#define _PSTR1CON_CMPL_MASK                      0x000000C0
#define _PSTR1CON_CMPL_LENGTH                    0x00000002

#define _PSTR1CON_CMPL0_POSITION                 0x00000006
#define _PSTR1CON_CMPL0_MASK                     0x00000040
#define _PSTR1CON_CMPL0_LENGTH                   0x00000001

#define _PSTR1CON_CMPL1_POSITION                 0x00000007
#define _PSTR1CON_CMPL1_MASK                     0x00000080
#define _PSTR1CON_CMPL1_LENGTH                   0x00000001

#define _CCP2CON_CCPM_POSITION                   0x00000000
#define _CCP2CON_CCPM_MASK                       0x0000000F
#define _CCP2CON_CCPM_LENGTH                     0x00000004

#define _CCP2CON_DCB_POSITION                    0x00000004
#define _CCP2CON_DCB_MASK                        0x00000030
#define _CCP2CON_DCB_LENGTH                      0x00000002

#define _CCP2CON_CCPM0_POSITION                  0x00000000
#define _CCP2CON_CCPM0_MASK                      0x00000001
#define _CCP2CON_CCPM0_LENGTH                    0x00000001

#define _CCP2CON_CCPM1_POSITION                  0x00000001
#define _CCP2CON_CCPM1_MASK                      0x00000002
#define _CCP2CON_CCPM1_LENGTH                    0x00000001

#define _CCP2CON_CCPM2_POSITION                  0x00000002
#define _CCP2CON_CCPM2_MASK                      0x00000004
#define _CCP2CON_CCPM2_LENGTH                    0x00000001

#define _CCP2CON_CCPM3_POSITION                  0x00000003
#define _CCP2CON_CCPM3_MASK                      0x00000008
#define _CCP2CON_CCPM3_LENGTH                    0x00000001

#define _CCP2CON_DCB0_POSITION                   0x00000004
#define _CCP2CON_DCB0_MASK                       0x00000010
#define _CCP2CON_DCB0_LENGTH                     0x00000001

#define _CCP2CON_DCB1_POSITION                   0x00000005
#define _CCP2CON_DCB1_MASK                       0x00000020
#define _CCP2CON_DCB1_LENGTH                     0x00000001

#define _CCP2CON_CCP2M_POSITION                  0x00000000
#define _CCP2CON_CCP2M_MASK                      0x0000000F
#define _CCP2CON_CCP2M_LENGTH                    0x00000004

#define _CCP2CON_DC2B_POSITION                   0x00000004
#define _CCP2CON_DC2B_MASK                       0x00000030
#define _CCP2CON_DC2B_LENGTH                     0x00000002

